(ns miyatake.data)

(def province-choices
  ["กระบี่"
   "กรุงเทพมหานคร"
   "กาญจนบุรี"
   "กาฬสินธุ์"
   "กำแพงเพชร"
   "ขอนแก่น"
   "จันทบุรี"
   "ฉะเชิงเทรา"
   "ชลบุรี"
   "ชัยนาท"
   "ชัยภูมิ"
   "ชุมพร"
   "ตรัง"
   "ตราด"
   "ตาก"
   "นครนายก"
   "นครปฐม"
   "นครพนม"
   "นครราชสีมา"
   "นครศรีธรรมราช"
   "นครสวรรค์"
   "นนทบุรี"
   "นราธิวาส"
   "น่าน"
   "บึงกาฬ"
   "บุรีรัมย์"
   "ปทุมธานี"
   "ประจวบคีรีขันธ์"
   "ปราจีนบุรี"
   "ปัตตานี"
   "พระนครศรีอยุธยา"
   "พะเยา"
   "พังงา"
   "พัทลุง"
   "พิจิตร"
   "พิษณุโลก"
   "ภูเก็ต"
   "มหาสารคาม"
   "มุกดาหาร"
   "ยะลา"
   "ยโสธร"
   "ร้อยเอ็ด"
   "ระนอง"
   "ระยอง"
   "ราชบุรี"
   "ลพบุรี"
   "ลำปาง"
   "ลำพูน"
   "ศรีสะเกษ"
   "สกลนคร"
   "สงขลา"
   "สตูล"
   "สมุทรปราการ"
   "สมุทรสงคราม"
   "สมุทรสาคร"
   "สระบุรี"
   "สระแก้ว"
   "สิงห์บุรี"
   "สุพรรณบุรี"
   "สุราษฎร์ธานี"
   "สุรินทร์"
   "สุโขทัย"
   "หนองคาย"
   "หนองบัวลำภู"
   "อ่างทอง"
   "อำนาจเจริญ"
   "อุดรธานี"
   "อุตรดิตถ์"
   "อุทัยธานี"
   "อุบลราชธานี"
   "เชียงราย"
   "เชียงใหม่"
   "เพชรบุรี"
   "เพชรบูรณ์"
   "เลย"
   "แพร่"
   "แม่ฮ่องสอน"])

(def populations
  {"กรุงเทพมหานคร"  5588222
   "สมุทรปราการ" 1351479
   "นนทบุรี" 1276745
   "ปทุมธานี"1176412
   "พระนครศรีอยุธยา" 819088
   "อ่างทอง"276584
   "ลพบุรี"742928
   "สิงห์บุรี" 205898
   "ชัยนาท"      322477
   "สระบุรี"      643828
   "ชลบุรี"  1566885
   "ระยอง"  741524
   "จันทบุรี"  535559
   "ตราด"  228536
   "ฉะเชิงเทรา" 720718
   "ปราจีนบุรี"  493670
   "นครนายก"  260081
   "สระแก้ว" 560925
   "นครราชสีมา"  2633207
   "บุรีรัมย์" 1581184
   "สุรินทร์"  1378221
   "ศรีสะเกษ"  1458580
   "อุบลราชธานี" 1866697
   "ยโสธร"  534500
   "ชัยภูมิ"  1124924
   "อำนาจเจริญ" 376195
   "บึงกาฬ"  422042
   "หนองบัวลำภู"  509470
   "ขอนแก่น"  1794531
   "อุดรธานี" 1567983
   "เลย"  638736
   "หนองคาย"  517435
   "มหาสารคาม"  953660
   "ร้อยเอ็ด"  1298640
   "กาฬสินธุ์"  977175
   "สกลนคร"  1146936
   "นครพนม"  717201
   "มุกดาหาร"  350911
   "เชียงใหม่" 1784370
   "ลำพูน"  402011
   "ลำปาง"  728964
   "อุตรดิตถ์" 448745
   "แพร่"  437350
   "น่าน"  476727
   "พะเยา"  467356
   "เชียงราย"  1295026
   "แม่ฮ่องสอน" 284549
   "นครสวรรค์" 1040308
   "อุทัยธานี"  325868
   "กำแพงเพชร"  714118
   "ตาก"  670265
   "สุโขทัย"  587883
   "พิษณุโลก" 849481
   "พิจิตร"  532310
   "เพชรบูรณ์" 981940
   "ราชบุรี"  869313
   "กาญจนบุรี" 891976
   "สุพรรณบุรี" 838628
   "นครปฐม"  920729
   "สมุทรสาคร"  586199
   "สมุทรสงคราม"  192052
   "เพชรบุรี" 482193
   "ประจวบคีรีขันธ์"   550678
   "นครศรีธรรมราช"   1550721
   "กระบี่ "  477770
   "พังงา"   268229
   "ภูเก็ต"   414471
   "สุราษฎร์ธานี"  1067726
   "ระนอง"   194372
   "ชุมพร"  509208
   "สงขลา"   1428609
   "สตูล" 324098
   "ตรัง"   640574
   "พัทลุง"   523077
   "ปัตตานี"   726015
   "ยะลา"   538602
   "นราธิวาส"   804429})


(defn rand-color []
  (.toString (rand-int 16rFFFFFF) 16))

(def color-list
  (into {} (map (fn [x]
                  {x (rand-color)}) province-choices)))
